"use strict";
Object.defineProperty(exports, "__esModule", { value: true });
exports.seedHoliday = void 0;
const nanoid_1 = require("nanoid");
const seedHoliday = async (database) => {
    await database.$executeRaw `
  INSERT INTO Holiday (id,name, year, month, day) VALUES (${(0, nanoid_1.nanoid)(11)},'광복절','2023','8','15')
  , (${(0, nanoid_1.nanoid)(11)},'추석','2023','9','28')
  , (${(0, nanoid_1.nanoid)(11)},'추석','2023','9','29')
  , (${(0, nanoid_1.nanoid)(11)},'추석','2023','9','30')
  , (${(0, nanoid_1.nanoid)(11)},'개천절','2023','10','3')
  , (${(0, nanoid_1.nanoid)(11)},'한글날','2023','10','9')
  , (${(0, nanoid_1.nanoid)(11)},'크리스마스','2023','12','25')
  , (${(0, nanoid_1.nanoid)(11)},'새해','2024','1','1')
  , (${(0, nanoid_1.nanoid)(11)},'설날','2024','2','9')
  , (${(0, nanoid_1.nanoid)(11)},'설날','2024','2','10')
  , (${(0, nanoid_1.nanoid)(11)},'설날','2024','2','11')
  , (${(0, nanoid_1.nanoid)(11)},'삼일절','2024','3','1')
  , (${(0, nanoid_1.nanoid)(11)},'어린이날','2024','5','5')
  , (${(0, nanoid_1.nanoid)(11)},'부처님 오신 날','2024','5','15')
  , (${(0, nanoid_1.nanoid)(11)},'현충일','2024','6','6')
  , (${(0, nanoid_1.nanoid)(11)},'광복절','2024','8','15')
  , (${(0, nanoid_1.nanoid)(11)},'추석','2024','9','16')
, (${(0, nanoid_1.nanoid)(11)},'추석','2024','9','17')
, (${(0, nanoid_1.nanoid)(11)},'추석','2024','9','18')
, (${(0, nanoid_1.nanoid)(11)},'개천절','2024','10','3')
, (${(0, nanoid_1.nanoid)(11)},'한글날','2024','10','9')
, (${(0, nanoid_1.nanoid)(11)},'크리스마스','2024','12','25')


, (${(0, nanoid_1.nanoid)(11)},'새해','2025','1','1')
, (${(0, nanoid_1.nanoid)(11)},'설날','2025','1','28')
, (${(0, nanoid_1.nanoid)(11)},'설날','2025','1','29')
, (${(0, nanoid_1.nanoid)(11)},'설날','2025','1','30')
, (${(0, nanoid_1.nanoid)(11)},'삼일절','2025','3','1')
, (${(0, nanoid_1.nanoid)(11)},'어린이날','2025','5','5')
, (${(0, nanoid_1.nanoid)(11)},'부처님 오신 날','2025','5','8')
, (${(0, nanoid_1.nanoid)(11)},'현충일','2025','6','6')
, (${(0, nanoid_1.nanoid)(11)},'광복절','2025','8','15')
, (${(0, nanoid_1.nanoid)(11)},'개천절','2025','10','3')
, (${(0, nanoid_1.nanoid)(11)},'추석','2025','10','5')
, (${(0, nanoid_1.nanoid)(11)},'추석','2025','10','6')
, (${(0, nanoid_1.nanoid)(11)},'추석','2025','10','7')
, (${(0, nanoid_1.nanoid)(11)},'한글날','2025','10','9')
, (${(0, nanoid_1.nanoid)(11)},'크리스마스','2025','12','25')

, (${(0, nanoid_1.nanoid)(11)},'새해','2026','1','1')
, (${(0, nanoid_1.nanoid)(11)},'설날','2026','2','16')
, (${(0, nanoid_1.nanoid)(11)},'설날','2026','2','17')
, (${(0, nanoid_1.nanoid)(11)},'설날','2026','2','18')
, (${(0, nanoid_1.nanoid)(11)},'삼일절','2026','3','1')
, (${(0, nanoid_1.nanoid)(11)},'어린이날','2026','5','5')
, (${(0, nanoid_1.nanoid)(11)},'부처님 오신 날','2026','5','8')
, (${(0, nanoid_1.nanoid)(11)},'현충일','2026','6','6')
, (${(0, nanoid_1.nanoid)(11)},'광복절','2026','8','15')
, (${(0, nanoid_1.nanoid)(11)},'추석','2026','9','24')
, (${(0, nanoid_1.nanoid)(11)},'추석','2026','9','25')
, (${(0, nanoid_1.nanoid)(11)},'추석','2026','9','26')
, (${(0, nanoid_1.nanoid)(11)},'추석','2026','9','27')
, (${(0, nanoid_1.nanoid)(11)},'개천절','2026','10','3')
, (${(0, nanoid_1.nanoid)(11)},'한글날','2026','10','9')
, (${(0, nanoid_1.nanoid)(11)},'크리스마스','2026','12','25')
 `;
};
exports.seedHoliday = seedHoliday;
//# sourceMappingURL=holiday.js.map